Show / Hide Table of Contents
Class LoadCase
Load case in the model
Inheritance
System.Object
OpenObject
OpenElementId
LoadCase
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.LoadCase,CI.Loading", "CI.StructModel.Loading.ILoadCase,CI.BasicTypes")]
public class LoadCase : OpenElementId
Examples
This sample shows how to create a load case.
//Creating the model
OpenModel openModel = new OpenModel();
//Load group - needed for Load case
LoadGroupEC loadGroup = new LoadGroupEC();
loadGroup.Name = "LG1";
loadGroup.GammaQ = 1.5;
loadGroup.Psi0 = 0.7;
loadGroup.Psi1 = 0.5;
loadGroup.Psi2 = 0.3;
loadGroup.GammaGInf = 1.0;
loadGroup.GammaGSup = 1.35;
loadGroup.Dzeta = 0.85;
openModel.AddObject(loadGroup);
//Load case
LoadCase loadCase = new LoadCase();
loadCase.Name = "LC1";
loadCase.LoadType = LoadCaseType.Permanent;
loadCase.Type = LoadCaseSubType.PermanentStandard;
loadCase.Variable = VariableType.NotSet;
loadCase.LoadGroup = new ReferenceElement(loadGroup);
openModel.AddObject(loadCase);
Constructors
Improve this Doc   View Source
LoadCase()
Constructor
Declaration
public LoadCase()
Properties
Improve this Doc   View Source
Description
Additional info
Declaration
public string Description { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
LoadGroup
Load group
Declaration
public ReferenceElement LoadGroup { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
LoadsInPoint
List of point load impulses in this load case
Declaration
public List<ReferenceElement> LoadsInPoint { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
LoadsOnLine
List of line load impulses in this load case
Declaration
public List<ReferenceElement> LoadsOnLine { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
LoadsOnSurface
List surafce load in this load case
Declaration
public List<ReferenceElement> LoadsOnSurface { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
LoadType
Load case type
Declaration
public LoadCaseType LoadType { get; set; }
Property Value
 Type |  Description
 LoadCaseType
Improve this Doc   View Source
Name
Name of load case
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
PointLoadsOnLine
List of point load impulses in this load case
Declaration
public List<ReferenceElement> PointLoadsOnLine { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
Settlements
Settlements in this load case
Declaration
public List<ReferenceElement> Settlements { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
StrainLoadsOnLine
List of generalized strain load impulses along the line in this load case.
Declaration
public List<ReferenceElement> StrainLoadsOnLine { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
TemperatureLoadsOnLine
List of temperature load in this load case
Declaration
public List<ReferenceElement> TemperatureLoadsOnLine { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
Type
Sub type
Declaration
public LoadCaseSubType Type { get; set; }
Property Value
 Type |  Description
 LoadCaseSubType
Improve this Doc   View Source
Variable
Variable type
Declaration
public VariableType Variable { get; set; }
Property Value
 Type |  Description
 VariableType
 Improve this Doc
 View Source